
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <!--
This HTML was auto-generated from MATLAB code.
To make changes, update the MATLAB code and republish this document.
      --><title>&#22270;&#24418;&#29992;&#25143;&#30028;&#38754;&#30340;&#20351;&#29992;</title><meta name="generator" content="MATLAB 9.2"><link rel="schema.DC" href="http://purl.org/dc/elements/1.1/"><meta name="DC.date" content="2018-04-01"><meta name="DC.source" content="doc_02_gui.m"><style type="text/css">
html,body,div,span,applet,object,iframe,h1,h2,h3,h4,h5,h6,p,blockquote,pre,a,abbr,acronym,address,big,cite,code,del,dfn,em,font,img,ins,kbd,q,s,samp,small,strike,strong,sub,sup,tt,var,b,u,i,center,dl,dt,dd,ol,ul,li,fieldset,form,label,legend,table,caption,tbody,tfoot,thead,tr,th,td{margin:0;padding:0;border:0;outline:0;font-size:100%;vertical-align:baseline;background:transparent}body{line-height:1}ol,ul{list-style:none}blockquote,q{quotes:none}blockquote:before,blockquote:after,q:before,q:after{content:'';content:none}:focus{outine:0}ins{text-decoration:none}del{text-decoration:line-through}table{border-collapse:collapse;border-spacing:0}

html { min-height:100%; margin-bottom:1px; }
html body { height:100%; margin:0px; font-family:Arial, Helvetica, sans-serif; font-size:10px; color:#000; line-height:140%; background:#fff none; overflow-y:scroll; }
html body td { vertical-align:top; text-align:left; }

h1 { padding:0px; margin:0px 0px 25px; font-family:Arial, Helvetica, sans-serif; font-size:1.5em; color:#d55000; line-height:100%; font-weight:normal; }
h2 { padding:0px; margin:0px 0px 8px; font-family:Arial, Helvetica, sans-serif; font-size:1.2em; color:#000; font-weight:bold; line-height:140%; border-bottom:1px solid #d6d4d4; display:block; }
h3 { padding:0px; margin:0px 0px 5px; font-family:Arial, Helvetica, sans-serif; font-size:1.1em; color:#000; font-weight:bold; line-height:140%; }

a { color:#005fce; text-decoration:none; }
a:hover { color:#005fce; text-decoration:underline; }
a:visited { color:#004aa0; text-decoration:none; }

p { padding:0px; margin:0px 0px 20px; }
img { padding:0px; margin:0px 0px 20px; border:none; }
p img, pre img, tt img, li img, h1 img, h2 img { margin-bottom:0px; } 

ul { padding:0px; margin:0px 0px 20px 23px; list-style:square; }
ul li { padding:0px; margin:0px 0px 7px 0px; }
ul li ul { padding:5px 0px 0px; margin:0px 0px 7px 23px; }
ul li ol li { list-style:decimal; }
ol { padding:0px; margin:0px 0px 20px 0px; list-style:decimal; }
ol li { padding:0px; margin:0px 0px 7px 23px; list-style-type:decimal; }
ol li ol { padding:5px 0px 0px; margin:0px 0px 7px 0px; }
ol li ol li { list-style-type:lower-alpha; }
ol li ul { padding-top:7px; }
ol li ul li { list-style:square; }

.content { font-size:1.2em; line-height:140%; padding: 20px; }

pre, code { font-size:12px; }
tt { font-size: 1.2em; }
pre { margin:0px 0px 20px; }
pre.codeinput { padding:10px; border:1px solid #d3d3d3; background:#f7f7f7; }
pre.codeoutput { padding:10px 11px; margin:0px 0px 20px; color:#4c4c4c; }
pre.error { color:red; }

@media print { pre.codeinput, pre.codeoutput { word-wrap:break-word; width:100%; } }

span.keyword { color:#0000FF }
span.comment { color:#228B22 }
span.string { color:#A020F0 }
span.untermstring { color:#B20000 }
span.syscmd { color:#B28C00 }

.footer { width:auto; padding:10px 0px; margin:25px 0px 0px; border-top:1px dotted #878787; font-size:0.8em; line-height:140%; font-style:italic; color:#878787; text-align:left; float:none; }
.footer p { margin:0px; }
.footer a { color:#878787; }
.footer a:hover { color:#878787; text-decoration:underline; }
.footer a:visited { color:#878787; }

table th { padding:7px 5px; text-align:left; vertical-align:middle; border: 1px solid #d6d4d4; font-weight:bold; }
table td { padding:7px 5px; text-align:left; vertical-align:top; border:1px solid #d6d4d4; }





  </style></head><body><div class="content"><h1>&#22270;&#24418;&#29992;&#25143;&#30028;&#38754;&#30340;&#20351;&#29992;</h1><!--introduction--><p>&#22270;&#24418;&#29992;&#25143;&#30028;&#38754;&#65288;Graphical User Interface&#65289;&#21644;&#21629;&#20196;&#34892;&#30028;&#38754;&#65288;Command-Line Interface&#65289;&#26159;&#20004;&#31181;&#24120;&#35265;&#30340;&#36719;&#20214;&#29992;&#25143;&#30028;&#38754;&#12290; &#23545;&#20110;&#26032;&#25163;&#26469;&#35828;&#65292;&#22270;&#24418;&#30028;&#38754;&#24448;&#24448;&#27604;&#21629;&#20196;&#34892;&#26356;&#21451;&#22909;&#12290; &#22240;&#27492;&#26412;&#24037;&#20855;&#31665;&#25552;&#20379;&#20102;&#19968;&#20010;&#22270;&#24418;&#30028;&#38754;&#65292;&#29992;&#20110;&#24110;&#21161;&#21021;&#23398;&#32773;&#26356;&#24555;&#22320;&#29087;&#24713;&#26049;&#36335;&#20998;&#26512;&#30340;&#27969;&#31243;&#12290;</p><!--/introduction--><h2>Contents</h2><div><ul><li><a href="#1">&#22270;&#24418;&#30028;&#38754;&#30340;&#21551;&#21160;</a></li><li><a href="#2">&#23548;&#20837;&#21151;&#32791;&#26354;&#32447;</a></li><li><a href="#3">&#26354;&#32447;&#30340;&#22522;&#26412;&#20449;&#24687;</a></li><li><a href="#4">.trs &#26684;&#24335;&#36716;&#20026; .mat &#26684;&#24335;</a></li><li><a href="#5">&#26597;&#30475;&#26354;&#32447;</a></li><li><a href="#6">&#38477;&#37319;&#26679;</a></li><li><a href="#7">&#20302;&#36890;</a></li><li><a href="#8">&#23545;&#40784;</a></li><li><a href="#9">&#25915;&#20987;</a></li></ul></div><h2 id="1">&#22270;&#24418;&#30028;&#38754;&#30340;&#21551;&#21160;</h2><p>&#21551;&#21160;&#22270;&#24418;&#30028;&#38754;&#24456;&#31616;&#21333;&#65292;&#21482;&#38656;&#35201;&#22312; MATLAB &#30340; Command Window &#20013;&#36755;&#20837;&#22914;&#19979;&#21629;&#20196;&#65306;</p><p><div style="background-color:#DDDDDD; overflow:auto; font-family:Consolas;">
  scamaster
</div></p><p>&#31245;&#31561;&#20960;&#31186;&#65292;&#20320;&#23601;&#33021;&#30475;&#21040;&#22914;&#19979;&#30028;&#38754;&#65306;</p><p><p align="center">
<img width=85% src="../images/gui_main.png">
</p></p><p>&#30028;&#38754;&#26377;&#22914;&#19979;&#20960;&#20010;&#37096;&#20998;&#65306;</p><div><ul><li>&#33756;&#21333;&#26639;&#65288;&#19978;&#26041;&#65289;&#65306;&#29992;&#20110;&#25191;&#34892;&#19968;&#31995;&#21015;&#38024;&#23545;&#21151;&#32791;&#26354;&#32447;&#30340;&#25805;&#20316;&#65292;&#27604;&#22914;&#23548;&#20837;&#12289;&#26597;&#30475;&#21644;&#20998;&#26512;</li><li>&#21464;&#37327;&#27983;&#35272;&#21306;&#65288;&#24038;&#19978;&#65289;&#65306;&#21487;&#20197;&#26597;&#30475;&#24403;&#21069;&#23548;&#20837;&#30340;&#21151;&#32791;&#26354;&#32447;&#25991;&#20214;&#21644;&#27491;&#22312;&#30340;&#20013;&#38388;&#26354;&#32447;</li><li>&#20449;&#24687;&#23637;&#31034;&#21306;&#65288;&#24038;&#19979;&#65289;&#65306;&#23637;&#31034;&#25152;&#36873;&#21151;&#32791;&#26354;&#32447;&#25991;&#20214;&#30340;&#30456;&#20851;&#32454;&#33410;</li><li>&#26354;&#32447;&#32472;&#21046;&#21306;&#65288;&#21491;&#20391;&#65289;&#65306;&#32472;&#21046;&#24182;&#26597;&#30475;&#26354;&#32447;</li></ul></div><h2 id="2">&#23548;&#20837;&#21151;&#32791;&#26354;&#32447;</h2><p>&#20551;&#23450;&#20320;&#29616;&#22312;&#24050;&#32463;&#36890;&#36807;&#35774;&#22791;&#37319;&#38598;&#20102;&#30828;&#20214;&#30340;&#21151;&#32791;&#26354;&#32447;&#65292;&#20854;&#26684;&#24335;&#20026; .trs&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#22914;&#19979;&#26041;&#27861;&#23548;&#20837;&#35813;&#26354;&#32447;&#65306;</p><div><ol><li>&#22312;&#33756;&#21333;&#26639;&#20013;&#28857;&#20987;&#65306;&#25991;&#20214; &gt; &#23548;&#20837;</li><li>&#36825;&#26102;&#20250;&#24377;&#20986;&#25991;&#20214;&#36873;&#25321;&#30340;&#31383;&#21475;&#65292;&#20320;&#21487;&#20197;&#36873;&#25321;&#19968;&#20010;&#25110;&#22810;&#20010;&#37319;&#38598;&#21040;&#30340;&#21151;&#32791;&#26354;&#32447;&#25991;&#20214;&#12290;</li></ol></div><p>&#23548;&#20837;&#26354;&#32447;&#21518;&#65292;&#21464;&#37327;&#27983;&#35272;&#21306;&#22914;&#19979;&#25152;&#31034;&#65306;</p><p><p align="center">
<img width=50% src="../images/gui_import.png">
</p></p><h2 id="3">&#26354;&#32447;&#30340;&#22522;&#26412;&#20449;&#24687;</h2><p>&#22312;&#21464;&#37327;&#27983;&#35272;&#21306;&#65292;&#21333;&#20987;&#26032;&#22686;&#30340;&#26354;&#32447;&#25152;&#22312;&#34892;&#65292;&#20320;&#20250;&#21457;&#29616;&#19979;&#38754;&#30340;&#20449;&#24687;&#21306;&#34920;&#26684;&#20013;&#20986;&#29616;&#20102;&#35813;&#25991;&#20214;&#30340;&#19968;&#20123;&#22522;&#26412;&#20449;&#24687;&#12290;</p><p><p align="center">
<img width=50% src="../images/gui_info.png">
</p></p><p>&#36825;&#20123;&#20449;&#24687;&#21253;&#25324;&#65306;&#25991;&#20214;&#20013;&#26354;&#32447;&#30340;&#26465;&#25968;&#12289;&#27599;&#26465;&#26354;&#32447;&#30340;&#26679;&#26412;&#28857;&#25968;&#12289;&#26679;&#26412;&#28857;&#30340;&#25968;&#20540;&#26684;&#24335;&#65292;&#31561;&#31561;&#12290;</p><p>&#25105;&#20204;&#22312;&#21518;&#32493;&#22788;&#29702;&#36825;&#20123;&#26354;&#32447;&#26102;&#65292;&#36825;&#20123;&#20449;&#24687;&#20250;&#24456;&#26377;&#29992;&#12290;</p><h2 id="4">.trs &#26684;&#24335;&#36716;&#20026; .mat &#26684;&#24335;</h2><p>&#35774;&#22791;&#37319;&#38598;&#24471;&#21040;&#30340;&#21151;&#32791;&#26354;&#32447;&#25991;&#20214;&#19968;&#33324;&#26159; .trs &#26684;&#24335;&#30340;&#65292;&#32780;&#36866;&#21512; MATLAB &#22788;&#29702;&#30340;&#26159; .mat &#26684;&#24335;&#12290; &#22240;&#27492;&#38656;&#35201;&#23558; .trs &#26684;&#24335;&#30340;&#25991;&#20214;&#36716;&#25442;&#25104; .mat &#26684;&#24335;&#12290; &#25805;&#20316;&#26041;&#27861;&#22914;&#19979;&#65306;</p><div><ol><li>&#22312;&#21464;&#37327;&#27983;&#35272;&#21306;&#24038;&#38190;&#21333;&#20987;&#35813;&#26354;&#32447;&#25152;&#22312;&#34892;&#65292;&#21491;&#38190;&#36873;&#25321;&#8220;&#36716;&#25442;&#25104; .mat &#26684;&#24335;&#8221;</li><li>&#36825;&#26102;&#20250;&#24377;&#20986;&#25991;&#20214;&#20445;&#23384;&#30340;&#31383;&#21475;&#65292;&#20320;&#21487;&#20197;&#37325;&#21629;&#21517;&#35813;&#25991;&#20214;&#20197;&#31526;&#21512;&#20064;&#24815;&#65292;&#28857;&#20987;&#8220;&#30830;&#23450;&#8221;&#24320;&#22987;&#36716;&#25442;</li><li>&#36716;&#25442;&#23436;&#25104;&#20250;&#25552;&#31034;&#26159;&#21542;&#25171;&#24320;&#36716;&#25442;&#21518;&#30340; .mat &#25991;&#20214;</li><li>&#22914;&#26524;&#36873;&#25321;&#25171;&#24320;&#65292;&#20320;&#23558;&#30475;&#21040;&#21464;&#37327;&#27983;&#35272;&#21306;&#22810;&#20102;&#19968;&#34892;&#65292;&#20854;&#26684;&#24335;&#20026; .mat</li></ol></div><p><p align="center">
<img width=50% src="../images/gui_convert.png">
</p></p><h2 id="5">&#26597;&#30475;&#26354;&#32447;</h2><p>&#24471;&#21040; .mat &#26684;&#24335;&#30340;&#25991;&#20214;&#21518;&#65292;&#25105;&#20204;&#36873;&#20013;&#26032;&#22686;&#30340;&#36825;&#19968;&#34892;&#65292;&#21491;&#38190;&#65292;&#21487;&#20197;&#30475;&#21040;&#25105;&#20204;&#33021;&#23454;&#26045;&#30340;&#25805;&#20316;&#21464;&#22810;&#20102;&#12290;</p><p>&#25105;&#20204;&#36873;&#25321;&#8220;&#26597;&#30475;&#26354;&#32447;&#8221;&#65306;</p><p><p align="center">
<img width=85% src="../images/gui_view.png">
</p></p><p>&#21491;&#19978;&#35282;&#26059;&#38062;&#20013;&#26174;&#31034;&#30340;&#26159;&#24403;&#21069;&#25152;&#26597;&#30475;&#30340;&#26354;&#32447;&#26159;&#31532;&#20960;&#26465;&#12290;</p><p>&#20320;&#21487;&#20197;&#28857;&#20987;&#25353;&#38062;&#65292;&#26597;&#30475;&#19978;&#19968;&#26465;&#25110;&#19979;&#19968;&#26465;&#26354;&#32447;&#65307;&#20063;&#21487;&#20197;&#30452;&#25509;&#36755;&#20837;&#25968;&#23383;&#65292;&#36339;&#21040;&#23545;&#24212;&#26354;&#32447;&#65307;&#36824;&#21487;&#20197;&#36890;&#36807;&#38190;&#30424;&#30340;&#19978;&#19979;&#26041;&#21521;&#38190;&#65292;&#20999;&#25442;&#26597;&#30475;&#30340;&#26354;&#32447;&#12290;</p><h2 id="6">&#38477;&#37319;&#26679;</h2><p>&#26377;&#26102;&#20505;&#65292;&#25105;&#20204;&#27599;&#26465;&#26354;&#32447;&#37319;&#30340;&#26679;&#26412;&#28857;&#25968;&#36807;&#22810;&#65292;&#25968;&#25454;&#37327;&#24456;&#22823;&#65292;&#22788;&#29702;&#26102;&#19981;&#20165;&#32791;&#26102;&#65292;&#32780;&#19988;&#36824;&#21487;&#33021;&#36896;&#25104;&#20869;&#23384;&#28322;&#20986;&#12290; &#22240;&#27492;&#25105;&#20204;&#26377;&#24517;&#35201;&#23545;&#21151;&#32791;&#26354;&#32447;&#36827;&#34892;&#38477;&#37319;&#26679;&#65292;&#20197;&#20943;&#23569;&#27599;&#26465;&#26354;&#32447;&#30340;&#26679;&#26412;&#28857;&#25968;&#65292;&#25552;&#39640;&#21518;&#32493;&#22788;&#29702;&#30340;&#25928;&#29575;&#12290;</p><p>&#20173;&#28982;&#26159;&#21333;&#20987;&#24819;&#22788;&#29702;&#30340;&#26354;&#32447;&#25152;&#22312;&#34892;&#65292;&#21491;&#38190;&#36873;&#25321;&#8220;&#38477;&#37319;&#26679;&#8221;&#65292;&#36825;&#26102;&#20250;&#24377;&#20986;&#8220;&#38477;&#37319;&#26679;&#21442;&#25968;&#35774;&#32622;&#8221;&#30340;&#30028;&#38754;&#12290;</p><p><p align="center">
<img width=45% src="../images/gui_downsample.png">
</p></p><p>&#36825;&#37324;&#30340;&#8220;&#38477;&#37319;&#26679;&#29575;&#8221;&#25351;&#30340;&#26159;&#26354;&#32447;&#25968;&#30446;&#20943;&#23569;&#30340;&#20493;&#25968;&#12290;&#27604;&#22914;&#37319;&#26679;&#29575;&#35774;&#32622;&#20026;10&#65292;&#37027;&#20040;&#20551;&#35774;&#21407;&#20808;&#27599;&#26465;&#26354;&#32447;&#26377;10000&#20010;&#28857;&#65292;&#38477;&#37319;&#26679;&#23436;&#23601;&#26159;1000&#20010;&#28857;&#12290;</p><p>&#36873;&#25321;&#36866;&#21512;&#30340;&#38477;&#37319;&#26679;&#29575;&#65292;&#28857;&#20987;&#8220;&#30830;&#23450;&#8221;&#12290;</p><p>&#36825;&#26102;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#21464;&#37327;&#27983;&#35272;&#21306;&#21448;&#22810;&#20102;&#19968;&#34892;&#65292;&#24182;&#19988;&#25991;&#20214;&#21517;&#21518;&#38754;&#22810;&#20102;&#8220;_ds&#8221;&#12290;&#8220;ds&#8220;&#26159; down sample&#65288;&#38477;&#37319;&#26679;&#65289;&#30340;&#39318;&#23383;&#27597;&#32553;&#20889;&#12290;</p><p><p align="center">
<img width=45% src="../images/gui_downsample2.png">
</p></p><p>&#20174;&#22270;&#20013;&#21487;&#20197;&#26126;&#26174;&#30475;&#20986;&#38477;&#37319;&#26679;&#21069;&#21518;&#26354;&#32447;&#30340;&#31890;&#24230;&#21464;&#21270;&#12290;</p><p><p align="center">
<img width=40% src="../images/gui_ds_bf.png">
<img width=40% src="../images/gui_ds_af.png">
</p></p><h2 id="7">&#20302;&#36890;</h2><p>&#37319;&#38598;&#21040;&#30340;&#26354;&#32447;&#24448;&#24448;&#20250;&#28151;&#26377;&#24456;&#22810;&#22122;&#22768;&#65292;&#36825;&#20123;&#22122;&#22768;&#22823;&#22810;&#25968;&#37117;&#22788;&#22312;&#39640;&#39057;&#37096;&#20998;&#65292;&#23545;&#25105;&#20204;&#30340;&#21151;&#32791;&#20998;&#26512;&#20135;&#29983;&#24178;&#25200;&#12290; &#23545;&#26354;&#32447;&#36827;&#34892;&#20302;&#36890;&#65292;&#21487;&#20197;&#28388;&#25481;&#22823;&#37096;&#20998;&#22122;&#22768;&#65292;&#25552;&#39640;&#22788;&#29702;&#30340;&#25928;&#29575;&#21644;&#31934;&#24230;&#12290;</p><p>&#21333;&#20987;&#38477;&#37319;&#26679;&#21518;&#30340;&#26354;&#32447;&#65292;&#21491;&#38190;&#36873;&#25321;&#8220;&#20302;&#36890;&#8221;&#12290;&#31245;&#31561;&#20960;&#31186;&#65292;&#20415;&#20250;&#24377;&#20986;&#20302;&#36890;&#21442;&#25968;&#35774;&#32622;&#30340;&#31383;&#21475;&#12290;</p><p><p align="center">
<img width=85% src="../images/gui_lowpass.png">
</p></p><p>&#19978;&#26041;&#30340;&#22270;&#20687;&#23637;&#31034;&#20102;&#21151;&#32791;&#26354;&#32447;&#30340;&#26102;&#22495;&#20449;&#24687;&#65292;&#19979;&#26041;&#30340;&#22270;&#20687;&#21576;&#29616;&#20102;&#39057;&#22495;&#20449;&#24687;&#12290;</p><p>&#20320;&#21487;&#20197;&#35774;&#32622;&#21491;&#20391;&#8220;&#26354;&#32447;&#26465;&#25968;&#8221;&#30340;&#20540;&#65292;&#26469;&#26597;&#30475;&#19981;&#21516;&#26354;&#32447;&#30340;&#26102;&#22495;&#21644;&#39057;&#22495;&#20449;&#24687;&#12290;</p><p>&#25302;&#21160;&#39057;&#22495;&#22270;&#20687;&#20013;&#40657;&#33394;&#30340;&#31895;&#32447;&#65292;&#26469;&#35774;&#32622;&#20302;&#36890;&#30340;&#25130;&#27490;&#39057;&#29575;&#65307;&#20063;&#21487;&#20197;&#36890;&#36807;&#35774;&#32622;&#21491;&#20391;&#8220;&#25130;&#27490;&#39057;&#29575;&#8221;&#20013;&#26059;&#38062;&#30340;&#20540;&#65292;&#23454;&#29616;&#21516;&#26679;&#30340;&#25928;&#26524;&#12290;</p><p>&#35843;&#25972;&#22909;&#25130;&#27490;&#39057;&#29575;&#21518;&#65292;&#21487;&#20197;&#28857;&#20987;&#8220;&#39044;&#35272;&#8221;&#65292;&#26597;&#30475;&#26032;&#30340;&#25130;&#27490;&#39057;&#29575;&#23545;&#26354;&#32447;&#20135;&#29983;&#30340;&#24433;&#21709;&#12290; &#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#30001;&#20110;&#20302;&#36890;&#25805;&#20316;&#38656;&#35201;&#32791;&#36153;&#19968;&#23450;&#30340;&#26102;&#38388;&#65292;&#22240;&#27492;&#23613;&#37327;&#36991;&#20813;&#39057;&#32321;&#22320;&#28857;&#20987;&#39044;&#35272;&#12290;</p><p>&#22914;&#26524;&#35843;&#25972;&#23436;&#25104;&#65292;&#28857;&#20987;&#8220;&#30830;&#23450;&#8221;&#65292;&#36719;&#20214;&#23601;&#20250;&#25353;&#29031;&#20320;&#35774;&#32622;&#30340;&#21442;&#25968;&#23545;&#26354;&#32447;&#36827;&#34892;&#20302;&#36890;&#12290;</p><p>&#36825;&#26102;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#21464;&#37327;&#27983;&#35272;&#21306;&#21448;&#22810;&#20102;&#19968;&#34892;&#65292;&#24182;&#19988;&#25991;&#20214;&#21517;&#21518;&#38754;&#22810;&#20102;&#8220;_lp&#8221;&#12290;&#8220;lp&#8220;&#26159; low pass&#65288;&#20302;&#36890;&#65289;&#30340;&#39318;&#23383;&#27597;&#32553;&#20889;&#12290;</p><p><p align="center">
<img width=50% src="../images/gui_lowpass2.png">
</p></p><p>&#20174;&#22270;&#20013;&#21487;&#20197;&#26126;&#26174;&#30475;&#20986;&#20302;&#36890;&#21069;&#21518;&#26354;&#32447;&#30340;&#31890;&#24230;&#21464;&#21270;&#12290;</p><p><p align="center">
<img width=40% src="../images/gui_ds_af.png">
<img width=40% src="../images/gui_lowpass3.png">
</p></p><h2 id="8">&#23545;&#40784;</h2><p>&#30001;&#20110;&#21508;&#31181;&#21407;&#22240;&#65292;&#30828;&#20214;&#35774;&#22791;&#37319;&#38598;&#21040;&#30340;&#19981;&#21516;&#21151;&#32791;&#26354;&#32447;&#24182;&#19981;&#26159;&#20005;&#26684;&#23545;&#40784;&#30340;&#12290; &#36825;&#21477;&#35805;&#30340;&#24847;&#24605;&#26159;&#65292;&#22312;&#37319;&#38598;&#21040;&#30340;&#19981;&#21516;&#26354;&#32447;&#30340;&#30456;&#21516;&#26102;&#21051;&#65292;&#23545;&#24212;&#30340;&#23454;&#38469;&#31243;&#24207;&#25351;&#20196;&#24182;&#19981;&#30456;&#21516;&#12290; &#22914;&#26524;&#21151;&#32791;&#26354;&#32447;&#20043;&#38388;&#27809;&#26377;&#23545;&#40784;&#65292;&#23601;&#26080;&#27861;&#36827;&#34892;&#26377;&#25928;&#30340;&#24046;&#20998;&#21151;&#32791;&#20998;&#26512;&#12290; &#22240;&#27492;&#65292;&#25105;&#20204;&#38656;&#35201;&#23545;&#23558;&#35201;&#25915;&#20987;&#30340;&#21306;&#22495;&#36827;&#34892;&#23545;&#40784;&#65292;&#20197;&#20445;&#35777;&#21516;&#19968;&#26102;&#21051;&#65292;&#23545;&#24212;&#30340;&#31243;&#24207;&#25351;&#20196;&#26159;&#30456;&#21516;&#30340;&#12290;</p><h2 id="9">&#25915;&#20987;</h2><p>&#22312;&#23545;&#26354;&#32447;&#36827;&#34892;&#20102;&#19978;&#36848;&#21508;&#31181;&#39044;&#22788;&#29702;&#20043;&#21518;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#23545;&#26354;&#32447;&#23454;&#26045;&#24046;&#20998;&#21151;&#32791;&#20998;&#26512;&#20102;&#12290;</p><p class="footer"><br><a href="http://www.mathworks.com/products/matlab/">Published with MATLAB&reg; R2017a</a><br></p></div><!--
##### SOURCE BEGIN #####
%% 图形用户界面的使用
%
% 图形用户界面（Graphical User Interface）和命令行界面（Command-Line Interface）是两种常见的软件用户界面。
% 对于新手来说，图形界面往往比命令行更友好。
% 因此本工具箱提供了一个图形界面，用于帮助初学者更快地熟悉旁路分析的流程。
% 
%% 图形界面的启动
%
% 启动图形界面很简单，只需要在 MATLAB 的 Command Window 中输入如下命令：
%
% <html><div style="background-color:#DDDDDD; overflow:auto; font-family:Consolas;">
%   scamaster
% </div></html>
%
% 稍等几秒，你就能看到如下界面：
% 
% <html><p align="center">
% <img width=85% src="../images/gui_main.png">
% </p></html>
%
% 界面有如下几个部分：
%
% * 菜单栏（上方）：用于执行一系列针对功耗曲线的操作，比如导入、查看和分析
% * 变量浏览区（左上）：可以查看当前导入的功耗曲线文件和正在的中间曲线
% * 信息展示区（左下）：展示所选功耗曲线文件的相关细节
% * 曲线绘制区（右侧）：绘制并查看曲线
% 
%% 导入功耗曲线
%
% 假定你现在已经通过设备采集了硬件的功耗曲线，其格式为 .trs。你可以通过如下方法导入该曲线：
% 
% # 在菜单栏中点击：文件 > 导入
% # 这时会弹出文件选择的窗口，你可以选择一个或多个采集到的功耗曲线文件。
%
% 导入曲线后，变量浏览区如下所示：
%
% <html><p align="center">
% <img width=50% src="../images/gui_import.png">
% </p></html>
%
%% 曲线的基本信息
% 在变量浏览区，单击新增的曲线所在行，你会发现下面的信息区表格中出现了该文件的一些基本信息。
%
% <html><p align="center">
% <img width=50% src="../images/gui_info.png">
% </p></html>
%
% 这些信息包括：文件中曲线的条数、每条曲线的样本点数、样本点的数值格式，等等。
%
% 我们在后续处理这些曲线时，这些信息会很有用。
% 
%% .trs 格式转为 .mat 格式
% 设备采集得到的功耗曲线文件一般是 .trs 格式的，而适合 MATLAB 处理的是 .mat 格式。
% 因此需要将 .trs 格式的文件转换成 .mat 格式。
% 操作方法如下：
%
% # 在变量浏览区左键单击该曲线所在行，右键选择“转换成 .mat 格式”
% # 这时会弹出文件保存的窗口，你可以重命名该文件以符合习惯，点击“确定”开始转换
% # 转换完成会提示是否打开转换后的 .mat 文件
% # 如果选择打开，你将看到变量浏览区多了一行，其格式为 .mat
%
% <html><p align="center">
% <img width=50% src="../images/gui_convert.png">
% </p></html>
%
%
%% 查看曲线
% 得到 .mat 格式的文件后，我们选中新增的这一行，右键，可以看到我们能实施的操作变多了。
% 
% 我们选择“查看曲线”：
%
% <html><p align="center">
% <img width=85% src="../images/gui_view.png">
% </p></html>
% 
% 右上角旋钮中显示的是当前所查看的曲线是第几条。
% 
% 你可以点击按钮，查看上一条或下一条曲线；也可以直接输入数字，跳到对应曲线；还可以通过键盘的上下方向键，切换查看的曲线。
%
%% 降采样
% 有时候，我们每条曲线采的样本点数过多，数据量很大，处理时不仅耗时，而且还可能造成内存溢出。
% 因此我们有必要对功耗曲线进行降采样，以减少每条曲线的样本点数，提高后续处理的效率。
%
% 仍然是单击想处理的曲线所在行，右键选择“降采样”，这时会弹出“降采样参数设置”的界面。
% 
% <html><p align="center">
% <img width=45% src="../images/gui_downsample.png">
% </p></html>
%
% 这里的“降采样率”指的是曲线数目减少的倍数。比如采样率设置为10，那么假设原先每条曲线有10000个点，降采样完就是1000个点。
% 
% 选择适合的降采样率，点击“确定”。
%
% 这时我们可以看到变量浏览区又多了一行，并且文件名后面多了“_ds”。“ds“是 down sample（降采样）的首字母缩写。
%
% <html><p align="center">
% <img width=45% src="../images/gui_downsample2.png">
% </p></html>
% 
% 从图中可以明显看出降采样前后曲线的粒度变化。
%
% <html><p align="center">
% <img width=40% src="../images/gui_ds_bf.png">
% <img width=40% src="../images/gui_ds_af.png">
% </p></html>
%
%
%% 低通
% 采集到的曲线往往会混有很多噪声，这些噪声大多数都处在高频部分，对我们的功耗分析产生干扰。
% 对曲线进行低通，可以滤掉大部分噪声，提高处理的效率和精度。
%
% 单击降采样后的曲线，右键选择“低通”。稍等几秒，便会弹出低通参数设置的窗口。
%
% <html><p align="center">
% <img width=85% src="../images/gui_lowpass.png">
% </p></html>
%
% 上方的图像展示了功耗曲线的时域信息，下方的图像呈现了频域信息。
%
% 你可以设置右侧“曲线条数”的值，来查看不同曲线的时域和频域信息。
%
% 拖动频域图像中黑色的粗线，来设置低通的截止频率；也可以通过设置右侧“截止频率”中旋钮的值，实现同样的效果。
%
% 调整好截止频率后，可以点击“预览”，查看新的截止频率对曲线产生的影响。
% 需要注意的是，由于低通操作需要耗费一定的时间，因此尽量避免频繁地点击预览。
%
% 如果调整完成，点击“确定”，软件就会按照你设置的参数对曲线进行低通。
%
% 这时我们可以看到变量浏览区又多了一行，并且文件名后面多了“_lp”。“lp“是 low pass（低通）的首字母缩写。
%
% <html><p align="center">
% <img width=50% src="../images/gui_lowpass2.png">
% </p></html>
%
%
% 从图中可以明显看出低通前后曲线的粒度变化。
%
% <html><p align="center">
% <img width=40% src="../images/gui_ds_af.png">
% <img width=40% src="../images/gui_lowpass3.png">
% </p></html>
%
%% 对齐
% 由于各种原因，硬件设备采集到的不同功耗曲线并不是严格对齐的。
% 这句话的意思是，在采集到的不同曲线的相同时刻，对应的实际程序指令并不相同。
% 如果功耗曲线之间没有对齐，就无法进行有效的差分功耗分析。
% 因此，我们需要对将要攻击的区域进行对齐，以保证同一时刻，对应的程序指令是相同的。
%
%% 攻击
% 在对曲线进行了上述各种预处理之后，我们就可以对曲线实施差分功耗分析了。














##### SOURCE END #####
--></body></html>